{
  "Menu": 
  {
    "title": "GENESIS",
    "subtitle": "Molecular Dynamics Simulator",
    "button_tutorials": "Tutorials",
    "button_scenarios": "Scenarios",
    "button_load": "Load Simulation",
    "button_sandbox": "Sandbox Mode",
    "button_challenges": "Challenges",
    "button_options": "Options",
    "button_achievements": "Achievements",
    "button_quit": "Exit",
    "info_version": "Version 0.1-alpha",
    "info_author": "Made by Gabriel Viegas",

    "Options":
    {
      "title": "Options Menu",
      "tab_graphics": "Graphics",
      "tab_render_mode": "Render Mode:",
      "tab_target_fps": "Target Fps",
      
      "tab_audio": "Audio",
      "tab_audio_master": "Master Volume",
      "tab_audio_background": "Background Music",
      "tab_audio_effects": "Sound Effects",

      "tab_language": "Localization",

      "tab_exit": "Close Options Menu",

      "render_modes":
      {
        "ball_and_stick": "Ball And Stick",
        "hyper_balls": "Hyper Balls",
        "letter_and_stick": "Letter And Stick",
        "licorice": "Licorice",
        "space_filling": "Space Filling"
      },

      "color_modes":
      {
        "color": "Color",
        "velocity": "Velocity",
        "charge": "Charge"
      }
    },

    "Sandbox_Creation":
    {
      "title": "Sandbox Creation Menu",

      "header_physics": "Physics and Thermodynamics",
      "gravity_enabled": "Gravity enabled",
      "gravity_magnitude": "Gravity magnitude",
      "wall_collision": "Wall collision",
      "roof_floor_collision": "Roof and Floor collision",
      "isothermal": "Isothermal",
      "reactive": "Reactive Mode (Not Released)",

      "header_box": "Simulation Box",
      "box_dimensions": "Box Dimensions (Angstroms)",
      "box_cubic": "Cubic Box (Equal Sides)",

      "header_visual": "Visualization",
      "render_water": "Render Water (H2O)",

      "header_logging": "Logging",
      "log_reactions": "Log Reactions",

      "button_create": "Create (pocket) Universe",
      "button_cancel": "Cancel"
    },

    "Tutorial":
    {
      "title": "Tutorial",
      
      "tutorial_types":
      [
        "ENGINE",
        "CLASSICAL",
        "QUANTUM",
        "CHEMISTRY"
      ],

      "titles":
      {
        "ENGINE":
        {
          "TUTORIAL_ENGINE_Controls": "Controls"
        },
        "CLASSICAL":
        {
          "TUTORIAL_CLASSICAL_VanDerWaals": "Van Der Waals Force",
          "TUTORIAL_CLASSICAL_CoulombForce": "Coulomb Force",
          "TUTORIAL_CLASSICAL_Phases": "Phase Transitions"
        },
        "QUANTUM":
        {
        
        },
        "CHEMISTRY":
        {
        
        }
      }
    },

    "Scene_Selection":
    {
      "title": "Scene Selection",

      "scene_types":
      [
        "MOLECULE",
        "DYNAMICS",
        "REACTIONS"
      ],

      "titles":
      {
        "MOLECULE":
        {
          "SCENARIO_MOLECULE_Water": "Water Molecule (H2O)",
          "SCENARIO_MOLECULE_Benzene": "Benzene Molecule (C6H6)",
          "SCENARIO_MOLECULE_CarbonDioxide": "Carbon Dioxide (CO2)"
        },
        "DYNAMICS":
        {
          "SCENARIO_DYNAMICS_browinian_motion": "Brownian Motion",
          "SCENARIO_DYNAMICS_CrystalNucleation": "Crystal Nucleation",
          "SCENARIO_DYNAMICS_DropletFormation": "Droplet Formation",
          "SCENARIO_DYNAMICS_AtmosphereLayers": "The Atmosphere and it's Layers"
        },
        "REACTIONS":
        {
        
        }
      }
    },
    
    "Simulation_Loading":
    {
      "title": "Saved Simulations",
      "button_load": "Load Simulation",
      "button_delete": "Delete Simulation",
      "true_delete": "Delete",
      "cancel": "Cancel",
      "warning": "Warning! This Simulation will be forever lost! Procced?"
    }
  },

  "Compounds":
  {
    "compound_names": 
    {
      "Empty because it's the default": ""
    },

    "compound_types":
    [
      "ORGANIC",
      "BIOMOLECULE",
      "INORGANIC",
      "ION",
      "NANOMATERIAL",
      "ELEMENTS"
    ],

    "compound_descriptions":
    {
      "Water": "Water (H2O) is vital for organisms and Earth's systems, being the 'universal solvent', dissolving substances for biological functions, regulating climate with its heat capacity, cycling through solid, liquid, and gas, and shaping landscapes while sustaining ecosystems.",
      "Acetone": "Acetone (C3H6O) is the simplest ketone, composed of three carbon atoms, six hydrogen atoms, and one oxygen atom. It is a colorless, volatile, and flammable liquid with a characteristic sweet odor. Acetone mixes readily with water and many organic solvents. It is widely used as an industrial and laboratory solvent, in the production of plastics, synthetic fibers, and pharmaceuticals, and is a common ingredient in nail polish removers.",
      "Carbon Dioxide": "Carbon dioxide (CO2) is a compound made of one carbon atom bonded to two oxygen atoms, naturally present in the atmosphere and essential to life processes. It plays a key role in photosynthesis. is a greenhouse gas.",
      "Ozone": "Ozone (O3) is a triatomic molecule composed of three oxygen atoms. It occurs naturally in the Earth's atmosphere, where it forms the ozone layer that protects living organisms by absorbing harmful ultraviolet radiation from the Sun.",
      "Ethylene": "Ethylene (C2H4), also known as ethene, is the simplest alkene, consisting of two carbon atoms joined by a double bond and four hydrogen atoms. It is a colorless, flammable gas with a faint sweet odor. Ethylene is a major product of the petrochemical industry, used as a feedstock for plastics such as polyethylene, and also functions as a plant hormone that regulates fruit ripening.",
      "Acetylene": "Acetylene (C2H2), also known as ethyne, is the simplest alkyne, composed of two carbon atoms joined by a triple bond and two hydrogen atoms. It is a colorless, highly flammable gas with a distinctive odor. Acetylene is widely used as a fuel in welding and cutting torches due to its hot, stable flame, and also serves as a feedstock in the synthesis of organic compounds.",
      "Methane": "Methane (CH4), composed of one carbon atom bonded to four hydrogen atoms, is the primary component of natural gas and a key energy source. It is a potent greenhouse gas.",
      "Carbon Monoxide": "Carbon monoxide (CO) is a colorless, odorless, and tasteless gas composed of one carbon atom bonded to one oxygen atom. It is produced by the incomplete combustion of carbon-containing fuels such as wood, coal, gasoline, and natural gas. Carbon monoxide binds strongly to hemoglobin in the blood, reducing oxygen transport and making it highly toxic to humans and animals.",
      "Silicon Dioxide": "Silicon dioxide (SiO2), also known as silica, is an inorganic compound composed of silicon and oxygen atoms in a 1:2 ratio. It occurs mainly as a crystalline solid, being the primary component of quartz and many rocks and sands. It is insoluble in water and chemically stable. Silicon dioxide is widely used in the manufacture of glass, ceramics, cement, semiconductors, and as a food additive (anticaking agent).",
      "TNT": "Trinitrotoluene (C7H5N3O6), commonly known as TNT, is an organic compound belonging to the nitroaromatic class. It is formed by substituting three nitro (-NO2) groups onto the aromatic ring of toluene. TNT appears as a yellow solid, relatively stable to handle but highly explosive when detonated. It is widely used in military and industrial applications as a standard explosive due to its ease of manufacture, chemical stability, and ability to be stored safely.",
      "Nitroglycerin": "Nitroglycerin (C3H5N3O9) is an organic compound belonging to the nitrate ester class, formed by the esterification of glycerol with nitric acid. It is an oily liquid, colorless to pale yellow, highly explosive, and sensitive to shock and heat. It is primarily used in the manufacture of explosives such as dynamite, but also has medical applications in small doses as a vasodilator for treating heart conditions. Due to its instability, it requires extremely careful storage and handling.",
      "Glycerol": "Glycerol (C3H8O3), also known as glycerin, is a trihydric alcohol composed of three carbon atoms, eight hydrogen atoms, and three hydroxyl (-OH) groups. It is a viscous, colorless, odorless liquid with a sweet taste. It is hygroscopic and miscible with water. Glycerol is widely used in the pharmaceutical and cosmetic industries as a humectant, in the manufacture of explosives such as nitroglycerin, in food as an additive, and in the production of resins and plastics.",
      "Ethane": "Ethane (C2H6) is a saturated hydrocarbon belonging to the alkane series, composed of two carbon atoms single-bonded to each other and surrounded by six hydrogen atoms. It is a colorless, odorless gas under standard conditions and occurs naturally in petroleum and natural gas.",
      "Ethanol": "Ethanol (C2H5OH) is an organic compound consisting of two carbon atoms, six hydrogen atoms, and one oxygen atom, classified as a simple alcohol. It is a volatile, flammable liquid with a characteristic odor, widely used as a solvent, fuel, and in the production of alcoholic beverages.",
      "Methanol": "Methanol (CH3OH) is the simplest alcohol, consisting of one methyl group and a hydroxyl group. It is a colorless, volatile, and flammable liquid with a faintly sweet odor. Methanol mixes completely with water and is widely used as a solvent, fuel, especially in the production of formaldehyde and acetic acid. Despite its industrial importance, methanol is highly toxic to humans, and exposure or ingestion can cause blindness, organ damage, or death.",
      "Phosphoric Acid": "Phosphoric acid (H3PO4) is an inorganic compound belonging to the class of phosphorus oxoacids. It appears as a crystalline solid or a colorless aqueous solution with an acidic taste. It is widely used in the fertilizer industry (as a phosphorus source), in beverages and foods as an acidulant, in detergent production, and in metal surface treatments. It is a moderate, triprotic acid, capable of donating three protons in aqueous solution.",
      "Thymine": "Thymine (C5H6N2O2) is a pyrimidine nitrogenous base found in DNA. It pairs with adenine through two hydrogen bonds. Thymine is essential for the stability of the double helix and for accurate replication of genetic material.",
      "Cytosine": "Cytosine (C4H5N3O) is a pyrimidine nitrogenous base found in both DNA and RNA. It pairs with guanine through three hydrogen bonds. Cytosine is crucial for genetic coding and epigenetic regulation via methylation.",
      "Adenine": "Adenine (C5H5N5) is a purine nitrogenous base found in both DNA and RNA. It pairs with thymine in DNA and with uracil in RNA through two hydrogen bonds. Adenine also plays a role in energy molecules such as ATP.",
      "Guanine": "Guanine (C5H5N5O) is a purine nitrogenous base found in both DNA and RNA. It pairs with cytosine through three hydrogen bonds. Guanine is essential for double helix stability and the fidelity of genetic information.",
      "Uracil": "Uracil (C4H4N2O2) is a pyrimidine nitrogenous base found only in RNA. It replaces thymine in base pairing, forming pairs with adenine through two hydrogen bonds.",
      "Sodium Bicarbonate": "Sodium bicarbonate (NaHCO3), also known as baking soda, is an ionic compound composed of sodium (Na+) and bicarbonate (HCO3-) ions. It appears as a white crystalline powder, soluble in water, with a slightly alkaline taste. It is widely used as a leavening agent in baking, an acid neutralizer, a household cleaning product, and in medical applications to relieve stomach acidity.",
      "Deoxyribose": "Deoxyribose (C5H10O4) is a monosaccharide of the pentose class, similar to ribose but lacking one oxygen atom at the 2' carbon. It is the fundamental sugar of DNA, forming the deoxyribose-phosphate backbone of nucleotides. It appears as a crystalline solid, soluble in water, and is essential for the stability and function of DNA.",
      "Beta-D-Ribose": "Beta-D-Ribose (C5H10O5) is a monosaccharide of the pentose class, with five carbon atoms and an aldehyde group. It is an essential sugar found in RNA, forming part of the ribose-phosphate backbone of nucleotides. It appears as a crystalline solid, highly soluble in water, and plays a key role in cellular metabolism and nucleic acid synthesis.",
      "Benzene": "Benzene (C6H6) is an aromatic hydrocarbon consisting of six carbon atoms arranged in a ring with alternating double bonds, stabilized by resonance. It is a colorless, volatile liquid with a sweet odor, widely used as a precursor in the production of plastics, resins, synthetic fibers, and numerous chemical compounds.",
      "Cubane": "Cubane (C8H8) is a highly strained hydrocarbon consisting of eight carbon atoms arranged at the corners of a cube, each bonded to a hydrogen atom. Despite its extreme angle strain, it is remarkably stable under normal conditions. Cubane is a colorless crystalline solid and serves as a fascinating molecule in research, with potential applications in high-energy materials, pharmaceuticals, and advanced chemical synthesis.",
      "Cuban-cetamol": "Cuban-cetamol is a hypothetical cubane-based analogue of paracetamol, designed by replacing the aromatic benzene ring with a cubane cage. It combines the strained cubic hydrocarbon core with hydroxyl and acetamide substituents, mimicking the functional groups of paracetamol.",
      "Pyrophosphoric Acid": "Pyrophosphoric acid (H4P2O7) is an inorganic compound belonging to the class of phosphorus oxoacids. It is formed by the condensation of two molecules of phosphoric acid with the elimination of one molecule of water. It appears as a crystalline solid or viscous solution and is a tetraprotic acid capable of donating four protons in aqueous solution. It is used in chemical synthesis, detergent formulations, and as an intermediate in phosphate production.",
      "Calcium Hydroxide": "Calcium hydroxide (Ca(OH)2), also known as slaked lime or hydrated lime, is an inorganic compound composed of calcium (Ca2+) and hydroxide (OH-) ions. It appears as a white solid, sparingly soluble in water, but capable of forming an alkaline solution known as limewater. It is widely used in construction (for mortars and plasters), in water and wastewater treatment, in the food industry as an acidity regulator, and in agriculture to neutralize acidic soils.",
      "Hydrogen Peroxide": "Hydrogen peroxide (H2O2) is a chemical compound made up of two hydrogen atoms and two oxygen atoms. It is a colorless liquid, slightly more viscous than water, with strong oxidizing properties. It is widely used as a disinfectant, bleaching agent, and in industrial processes. In diluted solutions, it is used for cleaning and medical care.",
      "Hydronium": "The hydronium ion (H3O+) is a cation formed when a water molecule (H2O) accepts a proton (H+). It is fundamental in acid-base chemistry, representing the hydrated form of the proton in aqueous solutions. Hydronium is responsible for the acidity of solutions, participating in chemical reactions and influencing pH. Although it does not exist as an isolated molecule under normal conditions, it is stabilized by solvation in water and plays a central role in biological and chemical processes.",
      "Propane": "Propane (C3H8) is a hydrocarbon belonging to the alkane family, composed of three carbon atoms and eight hydrogen atoms. It is a colorless and odorless gas in its pure form, but odorants are usually added to help detect leaks. Propane is widely used as a fuel for heating, cooking, engines, and in liquefied petroleum gas (LPG) systems. It also serves as a feedstock in the chemical industry. Due to its flammability, it requires careful storage and handling.",
      "Nitrogen": "Nitrogen (N2) is a diatomic molecule composed of two nitrogen atoms held together by a strong triple bond, making it chemically stable and inert under most conditions. It is a colorless, odorless gas that constitutes about 78% of Earth's atmosphere.",
      "Oxygen": "Oxygen (O2) is a diatomic molecule essential for life, composed of two oxygen atoms. It is a colorless, odorless gas that makes up about 21% of Earth's atmosphere. Oxygen is vital for cellular respiration in most organisms and supports combustion. While necessary for survival, high concentrations can be toxic, and low levels can cause hypoxia.",
      "C20 Fullerene": "C20 fullerene is the smallest fullerene, made of 20 carbon atoms in a cage-like dodecahedral structure. Its high strain makes it less stable than larger fullerenes like C60",
      "Ammonia": "Ammonia (NH3) is an inorganic compound of nitrogen and hydrogen, a colorless gas with a pungent odor. It is essential in fertilizers, serves as a building block for many chemicals, and plays a role in biological processes like protein metabolism.",
      "Citric Acid": "Citric acid (C6H8O7) is a weak organic acid belonging to the carboxylic acid class. It occurs naturally in citrus fruits such as lemons, oranges, and tangerines, giving them their characteristic sour taste. It appears as a white crystalline solid, highly soluble in water. Citric acid is widely used as a preservative and acidulant in food and beverages, cosmetics. In cellular metabolism, it plays a central role in the citric acid cycle (Krebs cycle).",
      "Sodium Hypobromite": "Sodium hypobromite (NaOBr) is an inorganic compound belonging to the hypohalite family, the sodium salt of hypobromous acid. It typically appears as yellow to orange crystals that are highly soluble in water. It functions as a strong oxidizing agent, analogous to sodium hypochlorite but less stable, tending to decompose readily. Sodium hypobromite is used in specialized chemical processes, organic synthesis, and as an intermediate in oxidation reactions.",
      "Formaldehyde": "Formaldehyde (CH2O) is the simplest aldehyde, a colorless, pungent gas that readily polymerizes. It is widely used in resins, disinfectants, preservatives, and as a precursor in chemical synthesis, though it is toxic and carcinogenic in high exposure.",
      "Acetic Acid": "Acetic acid (CH3COOH) is a carboxylic acid, the main component of vinegar, giving it a sour taste and pungent smell. It is a key industrial chemical used in producing plastics, solvents, and foods, and plays a role in metabolism.",
      "Pyridine": "Pyridine (C5H5N) is a heterocyclic aromatic compound containing a nitrogen atom in its ring. It is a colorless liquid with a distinctive odor, widely used as a solvent and chemical intermediate. Pyridine plays a key role in the synthesis of pharmaceuticals, agrochemicals, and vitamins, and serves as a base in many organic reactions due to its ability to accept protons.",
      "Isobutyric Acid": "Isobutyric acid ((CH3)2CHCOOH), also known as 2-methylpropanoic acid, is a branched short-chain fatty acid with a rancid butter-like odor. It occurs naturally in some foods and is used in flavors, perfumes, and as a chemical intermediate.",
      "Butanoic Acid": "Butanoic acid (C4H8O2), also known as butyric acid, is a short-chain carboxylic acid with a rancid odor reminiscent of butter or vomit. It occurs naturally in dairy products and is produced by intestinal bacteria. Butanoic acid contributes to flavors in certain foods and plays roles in energy metabolism and gut health. It is also used in the manufacture of esters for perfumes and flavorings.",
      "Sodium Hydroxide": "Sodium hydroxide (NaOH), also known as caustic soda or lye, is an ionic compound composed of sodium (Na+) and hydroxide (OH-) ions. It is a white, highly hygroscopic solid that dissolves readily in water, releasing significant heat upon dissolution. Sodium hydroxide is a strong base widely used in industry for paper manufacturing, soap and detergent production, chemical synthesis, and wastewater treatment.",
      "Cyclohexane": "Cyclohexane (C6H12) is a saturated cyclic hydrocarbon consisting of six carbon atoms arranged in a ring, each bonded to two hydrogen atoms. It is a colorless, flammable liquid with a mild odor, commonly used as a solvent and in the production of nylon and other industrial chemicals.",
      "Decane": "Decane (C10H22) is a hydrocarbon belonging to the alkane family, composed of ten carbon atoms and twenty-two hydrogen atoms in a linear chain. It is a colorless, flammable liquid, insoluble in water but miscible with organic solvents. Decane is used as a component of fuels, particularly gasoline, and as a solvent in industrial processes. It also serves as a reference compound in organic chemistry and physical chemistry studies due to its predictable properties within the alkane series.",
      "Alanine": "Alanine (C3H7NO2) is a non-essential alpha-amino acid with a methyl side chain, used in protein biosynthesis. It plays key roles in metabolism, including the glucose-alanine cycle, and serves as an energy source for muscles and the brain.",
      "Dopamine": "Dopamine (C8H11NO2) is a neurotransmitter and hormone belonging to the catecholamine class. It is synthesized from tyrosine via the intermediate L-DOPA. Dopamine acts as a chemical messenger in the central nervous system, regulating movement, motivation, mood, attention, and the reward system. It is metabolized mainly by the enzymes monoamine oxidase (MAO) and catechol-O-methyltransferase (COMT). Altered dopamine levels are associated with conditions such as Parkinson's disease, schizophrenia, and substance addiction.", 
      "Sodium Dodecyl Sulfate": "Sodium dodecyl sulfate (C12H25NaO4S), also known as SDS or sodium lauryl sulfate, is a widely used anionic surfactant. It appears as a white powder or paste, soluble in water, capable of reducing surface tension and producing foam. It is employed in detergents, shampoos, cleaning products, and in molecular biology laboratories, particularly in protein electrophoresis.",
      "Beta-D-Glucose": "Beta-D-glucose (C6H12O6) is a monosaccharide and the beta anomer of glucose, a primary energy source in biology. It forms the building block of cellulose in plants and is crucial in carbohydrate metabolism and energy production.",
      "Palmitic Acid": "Palmitic acid (C16H32O2) is a saturated long-chain fatty acid, abundant in palm oil, animal fats, and human tissues. It is a major component of cell membranes and used in soaps, cosmetics, and food production.",
      "Capric Acid": "Capric acid (C10H20O2), also known as decanoic acid, is a saturated fatty acid with a 10-carbon chain. It occurs naturally in coconut oil, palm kernel oil, and in the milk of cows and goats. Capric acid is a white crystalline solid with a melting point around 31 °C and a boiling point near 270 °C. It has a characteristic odor reminiscent of goats, from which its name derives (Latin 'caper/capra').",
      "Sulfuric Acid": "Sulfuric acid (H2SO4) is a strong mineral acid composed of hydrogen, sulfur, and oxygen. It is a dense, oily liquid that is highly corrosive and widely used in industry for fertilizer production, chemical synthesis, petroleum refining, and battery electrolytes.",
      "Oleic Acid": "Oleic acid (C18H34O2) is a monounsaturated fatty acid with an 18-carbon chain and one cis double bond at the ninth carbon (omega-9). It is the most abundant fatty acid in nature, found in olive oil, canola oil, and animal fats. Oleic acid is a colorless to pale yellow liquid at room temperature, insoluble in water but soluble in organic solvents.",
      "Cholesterol": "Cholesterol (C27H46O) is a sterol essential for cell membranes and hormone production. While vital, excess cholesterol in the blood can lead to plaque buildup in arteries, increasing the risk of heart disease and stroke.",
      "Diamond": "Diamond is a metastable allotrope of carbon with a face-centered cubic lattice. It is the hardest known natural material and an excellent thermal conductor.",
      "Heme A": "The heme group (C34H32N4O4) is the iron-containing prosthetic group in hemoglobin and myoglobin. It binds oxygen reversibly and gives blood its red color.",
      "Carbon Nanotube": "Carbon nanotubes are cylindrical nanostructures of rolled graphene sheets. They exhibit extraordinary tensile strength and electrical properties.",
      "Vitamin A": "Vitamin A (C20H30O) is a fat-soluble vitamin essential for vision, immune function, and cell growth. It occurs in several forms, including retinol, retinal, and retinoic acid, and is obtained from animal sources and carotenoids in plants.",
      "Paracetamol": "Paracetamol (C8H9NO2), also known as acetaminophen, is a common analgesic and antipyretic. It relieves pain and reduces fever but has minimal anti-inflammatory effects compared to NSAIDs.",
      "ATP": "Adenosine triphosphate (ATP, C10H16N5O13P3) is a nucleotide composed of adenine, ribose, and three phosphate groups. It is the primary energy carrier in living cells, storing and transferring energy for biological processes such as muscle contraction, nerve impulse transmission, and biosynthesis. ATP is continuously regenerated from ADP and phosphate during cellular respiration and photosynthesis, making it essential for life.",
      "DPPC": "Dipalmitoylphosphatidylcholine (C40H80NO8P) is a major phospholipid found in lung surfactant and cell membranes. It consists of a glycerol backbone linked to two palmitic acid chains and a phosphocholine head group. This amphipathic structure allows it to form stable bilayers, reducing surface tension in the lungs and enabling efficient gas exchange. Beyond its biological role, dipalmitoylphosphatidylcholine is widely used in biophysical and biochemical studies as a model membrane component.",
      "Nicotine": "Nicotine (C10H14N2) is a naturally occurring alkaloid found in tobacco plants. It acts as a stimulant by binding to nicotinic acetylcholine receptors in the brain.",
      "Aspirin": "Aspirin (C9H8O4), or acetylsalicylic acid, is a synthetic derivative of salicylic acid used as an analgesic, anti-inflammatory, antipyretic, and antiplatelet agent. It inhibits cyclooxygenase enzymes to reduce pain, fever, and blood clotting.",
      "Carborane Acid": "Carborane acid (H(CHB11Cl11)), also known as fluoroantimonic-like superacid, is one of the strongest known Brønsted acids. It consists of a proton bound to a carborane anion, which is remarkably stable and weakly coordinating. Unlike conventional acids, it does not corrode glass and can protonate extremely weak bases.",
      "Caffeine": "Caffeine (C8H10N4O2) is a methylxanthine alkaloid, a bitter white crystalline compound acting as a central nervous system stimulant. Found in coffee, tea, and cocoa, it blocks adenosine receptors to promote alertness.",
      "Sucrose": "Sucrose (C12H22O11) is a disaccharide composed of glucose and fructose units linked by a glycosidic bond. Commonly known as table sugar, it is a colorless, crystalline solid with a sweet taste. Sucrose is widely used as a sweetener in food and beverages and serves as an important energy source in human nutrition and plant metabolism.",
      "Sulfate": "Sulfate (SO4(-2)) is a polyatomic anion with a central sulfur atom bonded to four oxygen atoms in tetrahedral geometry. It forms many salts, essential in biology, industry (e.g., detergents, fertilizers), and as a nutrient in ecosystems.",
      "Nitrate": "Nitrate (NO3(-)) is a polyatomic anion with a central nitrogen atom bonded to three oxygen atoms in trigonal planar geometry. It is key in fertilizers, explosives, and biological processes, serving as a nitrogen source for plants.",
      "Ammonium": "Ammonium (NH4+) is a positively charged polyatomic ion formed when ammonia (NH3) accepts a proton. It plays a central role in nitrogen metabolism, serving as an intermediate in the assimilation of nitrogen by plants and microorganisms. Ammonium salts are widely used in fertilizers, explosives, and industrial processes, and in aqueous solutions it contributes to acid-base balance.",
      "Sodium Chloride": "Sodium chloride (NaCl), commonly known as table salt, is an ionic compound composed of sodium (Na+) and chloride (Cl-) ions. It is essential for life, playing a critical role in maintaining fluid balance, nerve transmission, and muscle function in living organisms. Beyond its biological importance, sodium chloride is widely used as a seasoning and preservative in food.",
      "Picene": "Picene (C22H14) is a polycyclic aromatic hydrocarbon composed of five benzene rings fused in a zigzag arrangement, belonging to the acene family. It is a crystalline solid with low solubility in water, studied for its electronic and optical properties.",
      "Octasulfur": "Octasulfur (S8) is the most stable and common allotrope of elemental sulfur, consisting of eight sulfur atoms arranged in a puckered ring structure. It is a bright yellow crystalline solid, insoluble in water but soluble in organic solvents. Octasulfur occurs naturally in volcanic regions and is widely used in the production of sulfuric acid, fertilizers, rubber vulcanization, and various industrial processes.",
      "Buckminsterfullerene": "Buckminsterfullerene (C60) is a spherical fullerene consisting of 60 carbon atoms arranged in a truncated icosahedron (soccer ball pattern). Discovered in 1985 and named after Buckminster Fuller due to its geodesic dome-like structure."
    }
  },

  "Simulation": 
  {
    "universe_ui":
    {
      "stats":
      {
        "title": "Universe Stats",

        "core_stats":
        {
          "title": "Core Stats",
          "temperature": "Temperature (K):",
          "pressure": "Pressure (Kpa):",
          "time": "Time",
          "particles": "Particles",
          "molecules": "Molecules",
          "slider_temperature": "Target T (K):",
          "slider_pressure": "Target P (Kpa):"
        },
        "charge_stats":
        {
          "title": "Charge Stats",
          "wall_charge_enabled": "Wall Charges Enabled",
          "magnetic_strength": "Magnetic Field Strength",
          "magnetic_enabled": "Magnetic Field Enabled"
        },
        "energy_stats":
        {
          "title": "Energy & Kinetics",
          "kinetic_energy": "Kinetic Energy",
          "potential_energy": "Potential Energy",
          "total_energy": "Total Energy"
        },
        "graphs_stats":
        {
          "title": "Graphs & Plots",
          "warning": "Frames need to be recorded in order for graphs to work!",
          "temperature_v_time": "Temperature X time"
        }
      },

      "tooltip_resume": "Resume Simulation",
      "tooltip_pause": "Pause Simulation",
      "tooltip_speedup": "Increase simulation speed",
      "tooltip_slowdown": "Decrease simulation speed",
      "tooltip_screenshot": "Take a screenshot",
      "tooltip_compound_selector": "Add Compound",
      "tooltip_scenario_disabled": "Disabled due to Scenario",
      "tooltip_emplace_molecule": "Press (G) to emplace Molecule,\n(Right Mouse) to cancel.\nHold (Shift) to continue placing",
      "tooltip_collision_good": "Good Position",
      "tooltip_collision_bad": "Collision Detected!",

      "video_controller":
      {
        "play_tooltip": "Resume Video",
        "pause_tooltip": "Pause Video",
        "restart_tooltip": "Restart Video",
        "record_start_tooltip": "Start Recording",
        "record_stop_tooltip": "Stop Recording",
        "play_speed": "Play Speed"
      },

      "compound_selector":
      {
        "title": "Compound Selector",
        "button_add": "Add Compound",
        "molar_weight": "M.W",
        "formula": "Formula",

        "tooltip_fullview": "Open detailed view",
        
        "full_view":
        {
          "close": "Close",
          "preview": "Chem Chards TM",
          "description": "Description",
          "add_simulation": "Add to the Simulation"
        },
        
        "periodic_title": "Periodic Table",
        "periodic_subtitle": "of Elements",
        "periodic_names": 
        [
          ["Hydrogen", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Helium"],
          ["Lithium", "Beryllium", "", "", "", "", "", "", "", "", "", "", "Boron", "Carbon", "Nitrogen", "Oxygen", "Fluorine", "Neon"],
          ["Sodium", "Magnesium", "", "", "", "", "", "", "", "", "", "", "Aluminium", "Silicon", "Phosphorus", "Sulfur", "Chlorine", "Argon"],
          ["Potassium", "Calcium", "Scandium", "Titanium", "Vanadium", "Chromium", "Manganese", "Iron", "Cobalt", "Nickel", "Copper", "Zinc", "Gallium", "Germanium", "Arsenic", "Selenium", "Bromine", "Krypton"],
          ["Rubidium", "Strontium", "Yttrium", "Zirconium", "Niobium", "Molybdenum", "Technetium", "Ruthenium", "Rhodium", "Palladium", "Silver", "Cadmium", "Indium", "Tin", "Antimony", "Tellurium", "Iodine", "Xenon"],
          ["Caesium", "Barium", "Lanthanum", "Hafnium", "Tantalum", "Tungsten", "Rhenium", "Osmium", "Iridium", "Platinum", "Gold", "Mercury", "Thallium", "Lead", "Bismuth", "Polonium", "Astatine", "Radon"],
          ["Francium", "Radium", "Actinium", "Rutherfordium", "Dubnium", "Seaborgium", "Bohrium", "Hassium", "Meitnerium", "Darmstadtium", "Roentgenium", "Copernicium", "Nihonium", "Flerovium", "Moscovium", "Livermorium", "Tennessine", "Oganesson"],
          ["", "", "Cerium", "Praseodymium", "Neodymium", "Promethium", "Samarium", "Europium", "Gadolinium", "Terbium", "Dysprosium", "Holmium", "Erbium", "Thulium", "Ytterbium", "Lutetium", "", ""],
          ["", "", "Thorium", "Protactinium", "Uranium", "Neptunium", "Plutonium", "Americium", "Curium", "Berkelium", "Californium", "Einsteinium", "Fermium", "Mendelevium", "Nobelium", "Lawrencium", "", ""]
        ]
      }
    },
    "pause_menu":
    {
      "title": "Pause Menu",
      "button_resume": "Resume Simulation",
      "button_restart": "Restart Simulation",
      "button_save": "Save Simulation",
      "button_load": "Load Simulation",
      "button_options": "Options",
      "button_exit_menu": "Exit to Menu",
      "simulation_name": "Simulation Name:",
      "warning": "Warning! All unsaved Progress will be lost!",
      "true_exit": "Exit",
      "cancel": "Cancel",
      "button_exit_desktop": "Exit to Desktop",
      "hint_esc": "Press ESC again to resume",
      "confirm_save": "Save"
    },
    "narration_menu":
    {
      "button_next": "Next",
      "button_previous": "Previous",
      "button_exit": "Exit",
      "button_close": "Close",
      "steps": "steps"
    }
  },

  "Scenarios":
  {
    "SCENARIO_MOLECULE_Water": 
    {
      "description": "The water molecule (H2O) - bent shape due to lone pairs, with a real bond angle of 104.5°. The foundation of hydrogen bonding and life as we know it.",
      "narrations": 
      [
        "This is the water molecule - H2O. One oxygen atom bonded to two hydrogen atoms.",
        "Notice the shape is not linear. The two hydrogen atoms are bent toward each other. Why? Because oxygen has two lone pairs of electrons that repel the bonding pairs.",
        "According to VSEPR theory, oxygen has four electron domains: two bonding pairs and two lone pairs. These four domains arrange themselves in a tetrahedral geometry to stay as far apart as possible.",
        "But the molecular shape only counts the atoms - so we see a bent or V-shaped molecule.",
        "The ideal tetrahedral angle is 109.5°, but the lone pairs push harder than bonding pairs, squeezing the H-O-H angle down to 104.5° in real life.",
        "That small difference matters a lot - it's why water is polar, forms hydrogen bonds, dissolves so many substances, and makes life possible.",
        "And talking about hydrogen bonds, Water really loves to make them, this is what allows celular membranes to form, because water packs together hydrophobic tails and hydrophillic heads together.",
        "Water - simple, yet extraordinary."
      ]
    },
    "SCENARIO_MOLECULE_Benzene": 
    {
      "description": "Benzene (C6H6) - the classic aromatic ring. Every carbon has a 120° bond angle and the electrons are delocalized, giving the molecule exceptional stability.",
      "narrations": 
      [
        "This is benzene - C6H6 - one of the most famous and important molecules in chemistry.",
        "Look at the six carbon atoms arranged in a perfect hexagon. Each carbon is bonded to two other carbons and one hydrogen.",
        "The bond angle at every carbon is exactly 120° - that's the signature of trigonal planar geometry.",
        "But benzene is special. The six pi electrons are not stuck between pairs of carbons - they are delocalized around the entire ring.",
        "This delocalization is often shown as a circle inside the hexagon. It makes the molecule much more stable than if it had three separate double bonds.",
        "That stability is called aromaticity. It's why benzene doesn't react like a normal alkene and why so many important molecules contain benzene rings.",
        "Benzene - simple, symmetrical, and incredibly stable."
      ]
    },
    "SCENARIO_MOLECULE_CarbonDioxide": 
    {
      "description": "Carbon dioxide (CO2) - a linear molecule with 180° bond angles. A simple yet crucial molecule for life and climate.",
      "narrations": 
      [
        "This is carbon dioxide - CO2. One carbon atom double-bonded to two oxygen atoms.",
        "Notice the perfectly straight, linear shape. The two oxygen atoms are exactly opposite each other across the carbon.",
        "According to VSEPR theory, carbon has two electron domains - both are bonding pairs (double bonds count as one domain each). Two domains arrange themselves as far apart as possible: 180° apart.",
        "The result is a linear molecular geometry with a bond angle of exactly 180°.",
        "This linearity is why CO2 is non-polar even though it has polar bonds - the dipoles cancel out perfectly.",
        "CO2 plays a huge role in the world: plants use it for photosynthesis, it traps heat in the atmosphere as a greenhouse gas, and it's what we exhale.",
        "Simple structure, massive impact."
      ]
    },
    "SCENARIO_DYNAMICS_browinian_motion":
    {
      "description": "In this scenario, you will see particles moving randomly, a classic example of Brownian motion.",
      "narrations":
      [
        "Welcome to the Brownian Motion Scenario! In this scenario, we'll see Brownian motion and what is it. There is an Oganesson (Z=118) Atom surrounded by helium (Z=2) gas.",
        "But what exactly is Brownian Motion?\nIt is the random, jittery movement of particles caused by countless collisions with surrounding molecules. These invisible impacts make the particles wander unpredictably, a microscopic dance driven by thermal energy.\n(Turn the SpaceFilling mode for better views!)"
      ]
    },
    "SCENARIO_DYNAMICS_CrystalNucleation": 
    {
      "description": "Watch krypton atoms in the liquid phase cool rapidly and spontaneously organize into a tiny crystal lattice. Order emerging from disorder.",
      "narrations": 
      [
        "Here we have a small sample of liquid krypton at low temperature, the atoms are moving around in a disordered way.",
        "Now we're cooling it further and further... notice how the motion slows down and small ordered patches start to appear.",
        "Look, a tiny crystal nucleus has formed! Once it appears, it grows quickly as nearby atoms join the ordered structure.",
        "The crystal continues to grow until most of the liquid has turned into a small piece of solid krypton lattice.\nThis process is called **nucleation and crystal growth**, it's how all crystals, from snowflakes to diamonds, begin."
      ]
    },
    "SCENARIO_DYNAMICS_DropletFormation": 
    {
      "description": "Watch neutral atoms condense from a chaotic gas into beautiful liquid droplets - a stunning demonstration of how van der Waals forces create liquids from scattered particles.",
      "narrations": 
      [
        "This is the Droplet Formation scenario. You're seeing something really special: how a hot, disorganized gas turns into organized liquid droplets.",
        "We start with 150 Argon atoms at high temperature - about 1000 K. They're flying around fast, colliding randomly... pure gas behavior, no order at all.",
        "Now the cooling begins. As the temperature drops, the atoms slow down... and something beautiful starts to happen. Small, dense patches appear!",
        "These little clusters are growing because van der Waals forces are gently pulling atoms together whenever they get close enough. The attraction is weak, but with enough particles, it becomes powerful.",
        "Look at the small droplets starting to meet... and when two touch, they quickly merge into one larger droplet. This is coalescence - the same process that grows raindrops in clouds.",
        "now we have fewer but much bigger droplets.",
        "And here's the end result: a few large, rounded droplets. The entire scattered gas cloud has transformed into many liquid spheroids - all thanks to those weak attractions between neutral atoms.",
        "This is how liquids form in the real world: gases condense, droplets merge, and eventually you get oceans, lakes, and rain. Van der Waals forces may be small, but they shape the entire liquid world around us.",
        "Incredible to watch, isn't it? One of nature's most elegant transformations - from chaos to order, just by cooling."
      ]
    },  
    "SCENARIO_DYNAMICS_AtmosphereLayers": 
    {
      "description": "See the composition of the atmosphere, and learn why it has layers.",
      "narrations": 
      [
        "This is the Atmosphere Layers scenario.",
        "We start with a random mix of air molecules - mostly nitrogen (N2), oxygen (O2), argon (Ar), and a tiny bit of carbon dioxide and methane.",
        "At first everything looks uniform - molecules flying around equally everywhere.",
        "But gravity (In Real Life, not in this Scenario) is pulling downward. Over time, heavier molecules (like argon and CO2) start sinking toward the bottom.",
        "Lighter molecules (mostly N2 and O2) stay higher up or get pushed upward by collisions.",
        "After a while, you can see clear layers forming - denser gas at the bottom, thinner gas at the top.",
        "This is exactly what happens in Earth's atmosphere: heavier gases concentrate lower, lighter ones higher - creating the layered structure we live in.",
        "Even though the forces are tiny, over time gravity sorts everything by mass. Beautiful, isn't it?",
        "A simple box, a bit of gravity, and the atmosphere begins to look like... an atmosphere."
      ]
    },
    "TUTORIAL_ENGINE_Controls": 
    {
      "description": "Master the basic controls: move the camera, pause time, add compounds, and more.",
      "narrations": 
      [
        "Welcome to the Controls tutorial!\nLet's quickly go over everything you need to explore and interact with the simulation.",
        "Use **WASD** to move the camera forward, backward, left, and right.\nHold the **right mouse button** and drag to look around and rotate the view.\nTry it now - move around a bit!",
        "Great! Now let's add something.\nclick the **+ button** in the bottom bar to open the compound selector.\nThis is the compound selector. You can choose from many molecules - more are added with every update.\nClick the **magnifying glass** next to any compound to see a bigger preview and details.",
        "You can add compounds while the simulation is running... but sometimes it's easier when everything is still.\nPress **SPACE** to pause and resume the simulation.",
        "When paused, the molecules freeze - perfect for inspecting structures, adding new compounds, or studying a specific moment.\nLook around freely, then press **SPACE** again to continue.",
        "You can also control time speed: the arrows in the bottom bar to speed up or slow down.\nTry speeding it up a little! (Warning: Speeding up too much may cause instability in the simulation!)",
        "That covers the essentials!\nYou're now ready to explore, build, and experiment.\nPress **Exit** to finish the tutorial - or stay and play around a bit more."
      ]
    },
    "TUTORIAL_CLASSICAL_VanDerWaals": 
    {
      "description": "Explore the Van der Waals forces: discover why neutral atoms attract each other at medium distances and strongly repel when too close. The hidden reason behind liquids, solids, and everyday stickiness.",
      "narrations": 
      [
        "Welcome to the Van der Waals Forces tutorial! Today you'll see one of the most important weak forces in nature, and why atoms behave the way they do.",
        "Here we have two neutral Argon atoms. No electric charge at all. So... why do you think they're slowly moving toward each other? Let's run the simulation and watch closely.",
        "Look at that, they're being pulled together... but then, when they get very close, they suddenly push apart! That attraction followed by strong repulsion is exactly what we call the **Van der Waals force**.",
        "How can two neutral atoms attract? Even though the atoms have no net charge, their electrons are constantly moving. At any moment, one side can become slightly more negative - creating a temporary **induced dipole**. The other atom responds by shifting its electrons too... and the opposite charges attract each other. That weak attraction is the **Van der Waals attraction**.",
        "Now Let's add more.. for fun and science!",
        "There's a perfect distance where attraction and repulsion exactly balance, that's called the **equilibrium distance** (about 3.8 Å for Argon). Here the net force is almost zero, and the atoms settle comfortably. This is why molecules have a natural 'size' and don't collapse into each other.",
        "When the electron clouds overlap too much, the **Pauli exclusion principle** kicks in: no two electrons can occupy the same space with the same quantum state. The energy cost becomes enormous - so the atoms push back very hard!",
        "That push-back is why nothing ever truly 'touches' in the classical world, it's all forces! Van der Waals forces are weak on their own, but they're everywhere: they hold liquids together, allow geckos to climb smooth walls, create surface tension, and even make your phone screen feel smooth.",
        "Now, to demonstrate how weak is this force, we'll increase the temperature, first know that the simulation is running at 500 fs/s, and at 2.0 Kelvin, really cold!",
        "Now that we've increased the temperature, the force is not enough to hold the particles together, solid argon quickly became a gas.. and now at 30 fs/s",
        "And Freeze Again!",
        "That's the Van der Waals force in action. You just witnessed one of the fundamental reasons everyday matter behaves the way it does. Great job!"
      ]
    },
    "TUTORIAL_CLASSICAL_CoulombForce": 
    {
      "description": "See how charged particles interact through Coulomb forces: opposite charges attract strongly, like charges repel violently. The foundation of ionic bonding, salts, and much of chemistry.",
      "narrations": 
      [
        "Welcome to the Coulomb Forces tutorial! This is one of the strongest everyday forces in the universe - and it's all about electric charges. Let's see it in action.",
        "Here we have two ions: a positively charged sodium ion (Na+ blue) and a negatively charged chloride ion (Cl- green). They're far apart... but watch closely. What do you think will happen?",
        "Wow - they rush toward each other incredibly fast! Opposite charges attract with a very powerful force. The closer they get, the stronger the pull becomes - that's Coulomb's law in action: force increases with 1/distance squared.",
        "Now let's try two ions with the same charge: two sodium ions (Na+ and Na+).",
        "Watch... they push each other away violently! Like charges repel - and the closer they are, the stronger the push.",
        "This push-and-pull is why salts exist. Metals like sodium give away electrons and become positive; non-metals like chlorine accept electrons and become negative. Opposite charges then hold them tightly together.",
        "Here's what happens when many of them come together: a crystal of sodium chloride (table salt). Look at the beautiful repeating pattern - positive and negative ions alternating in a perfect grid. This is the lowest-energy, most stable arrangement.",
        "But what happens when we add water? Water molecules have their own tiny charges - oxygen is slightly negative, hydrogens slightly positive. They surround and shield the ions, weakening the attraction between Na+ and Cl-.",
        "That's why salt dissolves in water: the water molecules pull the ions apart and keep them separated. The crystal breaks down - the salt 'disappears' into solution, even though the ions are still there.",
        "Coulomb forces are everywhere: they hold ionic compounds together, control how proteins fold, make your nerves send signals, and power batteries. It's one of the four fundamental forces that shape the world around us.",
        "You just witnessed how charge creates order and structure in matter. Amazing work - you now understand the Coulomb force!"
      ]
    },
    "TUTORIAL_CLASSICAL_Phases": 
    {
      "description": "See how temperature changes turn matter from gas to liquid to solid - a fundamental demonstration of phase transitions and the forces that hold materials together.",
      "narrations": 
      [
        "Welcome to the Phase Transitions tutorial! This is where we watch matter change its state - from gas to liquid to solid - just by changing temperature.",
        "We start with particles at very high temperature. They move fast and spread out everywhere... this is the gas phase: no structure, lots of random motion.",
        "Now we slowly lower the temperature. The particles slow down... and something interesting begins. Small, dense groups start to form - the very first tiny liquid droplets!",
        "As we keep cooling, those droplets grow larger and merge with each other. Soon the whole system becomes a smooth, continuous liquid. This is condensation - the attractive forces between particles finally overcome their thermal energy.",
        "Cool even further. The liquid starts to organize... ordered patches appear and grow. These are the first crystal nuclei forming!",
        "Watch the crystal spread. The particles arrange themselves into a regular, repeating pattern - a solid lattice. In the solid phase, particles vibrate in place but stay locked in an ordered structure.",
        "This is the basic story of phase transitions: temperature controls whether matter is gas, liquid, or solid. Heat gives particles energy to break free; cooling lets attractive forces take over and build structure.",
        "Every material does this in its own way - but the principle is the same: balance between thermal motion and intermolecular attraction.",
        "Amazing to see, right? You just watched matter go from complete chaos to perfect order - all by turning down the temperature. Well done!"
      ]
    }
  }
}