{
  "Menu": 
  {
    "title": "GENESIS",
    "subtitle": "Simulador de Dinâmica Molecular",
    "button_tutorials": "Tutoriais",
    "button_scenarios": "Cenários",
    "button_load": "Carregar Simulação",
    "button_sandbox": "Modo Sandbox",
    "button_challenges": "Desafios",
    "button_options": "Opções",
    "button_achievements": "Conquistas",
    "button_quit": "Sair",
    "info_version": "Versão 0.1-alpha",
    "info_author": "Feito por Gabriel Viegas",

    "Options":
    {
      "title": "Menu de Opções",
      "tab_graphics": "Gráficos",
      "tab_render_mode": "Modo de Renderização:",
      "tab_target_fps": "Fps Alvo",
      
      "tab_audio": "Audio",
      "tab_audio_master": "Volume Mestre",
      "tab_audio_background": "Música de Fundo",
      "tab_audio_effects": "Efeitos Sonoros",

      "tab_language": "Idioma",
      "tab_exit": "Fechar Menu de Opções",

      "render_modes":
      {
        "ball_and_stick": "Bola e Palito",
        "hyper_balls": "Hiper Bolas",
        "letter_and_stick": "Letra e Palito",
        "licorice": "Licorice",
        "space_filling": "Preenchedor de Espaço"
      }
    },

    "Sandbox_Creation":
    {
      "title": "Menu de Criação Sandbox",

      "header_physics": "Física e Termodinâmica",
      "gravity_enabled": "Gravidade ativa",
      "gravity_magnitude": "Constante da Gravidade",
      "wall_collision": "Colisão com Paredes",
      "roof_floor_collision": "Colisão com o Teto e o chão",
      "isothermal": "Isotérmico",
      "reactive": "Modo Reativo (Não Lançado)",

      "header_box": "Caixa de Simulação",
      "box_dimensions": "Dimensões da Caixa (Angstroms)",
      "box_cubic": "Caixa Cúbica (Equal Sides)",

      "header_visual": "Visualização",
      "render_water": "Renderizar Água (H2O)",

      "header_logging": "Registro",
      "log_reactions": "Registrar Reações",

      "button_create": "Criar Universo (De Bolso)",
      "button_cancel": "Cancelar"
    },

    "Tutorial":
    {
      "title": "Tutorial",
      
      "tutorial_types":
      [
        "MOTOR",
        "CLASSICO",
        "QUÂNTICO",
        "QUIMICA"
      ],

      "titles":
      {
        "ENGINE":
        {
          "TUTORIAL_ENGINE_Controls": "Controles"
        },
        "CLASSICAL":
        {
          "TUTORIAL_CLASSICAL_VanDerWaals": "Força Van Der Waals",
          "TUTORIAL_CLASSICAL_CoulombForce": "Força Coulomb",
          "TUTORIAL_CLASSICAL_Phases": "Transições de Fase"
        },
        "QUANTUM":
        {
        
        },
        "CHEMISTRY":
        {
        
        }
      }
    },

    "Scene_Selection":
    {
      "title": "Scene Selection",

      "scene_types":
      [
        "MOLÉCULA",
        "DINÂMICA",
        "REAÇÕES"
      ],

      "titles":
      {
        "MOLECULE":
        {
          "SCENARIO_MOLECULE_Water": "Molécula de Água (H2O)",
          "SCENARIO_MOLECULE_Benzene": "Molécula de Benzeno (C6H6)",
          "SCENARIO_MOLECULE_CarbonDioxide": "Molécula de Dioxido de Carbono (CO2)"
        },
        "DYNAMICS":
        {
          "SCENARIO_DYNAMICS_browinian_motion": "Movimentação Browniana",
          "SCENARIO_DYNAMICS_CrystalNucleation": "Nucleação de Cristal",
          "SCENARIO_DYNAMICS_DropletFormation": "Formação de Gotículas",
          "SCENARIO_DYNAMICS_AtmosphereLayers": "A Atmosféra e suas Camadas"
        },
        "REACTIONS":
        {
        
        }
      }
    },

    "Simulation_Loading":
    {
      "title": "Simulações Salvas",
      "button_load": "Carregar Simulação",
      "button_delete": "Deletar Simulação",
      "true_delete": "Deletar",
      "cancel": "Cancelar",
      "warning": "Alerta! Essa simulação será perdida para sempre. Prosseguir?"
    }
  },

  "Compounds":
  {
    "compound_names":
    {
      "Water": "Água",
      "Carbon Dioxide": "Dióxido de Carbono",
      "Ozone": "Ozônio",
      "Methane": "Metano",
      "Carbon Monoxide": "Monóxido de Carbono",
      "Ethane": "Etano",
      "Ethanol": "Etanol",
      "Methanol": "Metanol",
      "Benzene": "Benzeno",
      "Cubane": "Cubano",
      "Cuban-cetamol": "Cuban-cetamol",
      "Nitrogen": "Nitrogênio",
      "Oxygen": "Oxigênio",
      "C20 Fullerene": "Fulereno C20",
      "Cyclohexane": "Ciclo-hexano",
      "Sulfuric Acid": "Ácido sulfúrico",
      "Vitamin A": "Vitamina A",
      "Calcium Hydroxide": "Hidróxido de Cálcio",
      "Sodium Hydroxide": "Hidróxido de Sódio",
      "Sodium Bicarbonate": "Bicarbonato de Sódio",
      "Hydrogen Peroxide": "Peróxido de Hidrogênio",
      "Hydronium": "Hidrônio",
      "Ethylene": "Etíleno",
      "Acetylene": "Acetileno",
      "Silicon Dioxide": "Dióxido de Silício",
      "Nitroglycerin": "Nitroglicerina",
      "TNT": "TNT",
      "Beta-D-Ribose": "Beta-D-Ribose",
      "Deoxyribose": "Deoxyribose",
      "Phosphoric Acid": "Ácido fosfórico",
      "Decane": "Decano",
      "Ammonia": "Amônia",
      "Uracil": "Uracila",
      "Adenine": "Adenina",
      "Cytosine": "Citosina",
      "Guanine": "Guanina",
      "Thymine": "Timina",
      "Acetone": "Acetona",
      "Formaldehyde": "Formaldeído",
      "Glycerol": "Glicerol",
      "Pyridine": "Piridina",
      "Acetic Acid": "Ácido Acético",
      "Isobutyric Acid": "Ácido Isobutírico",
      "Butanoic Acid": "Ácido Butanóico",
      "Alanine": "Alanina",
      "Beta-D-Glucose": "Beta-D-Glicose",
      "Palmitic Acid": "Ácido Palmítico",
      "Capric Acid": "Ácido Cáprico",
      "Oleic Acid": "Ácido Oleico",
      "Cholesterol": "Colesterol",
      "Diamond": "Diamante",
      "Paracetamol": "Paracetamol",
      "Heme A": "Grupo Heme A",
      "DPPC": "DPPC",
      "Sucrose": "Sacarose",
      "Carbon Nanotube": "Nanotubo de carbono",
      "Pyrophosphoric Acid": "Ácido pirofosfórico",
      "Carborane Acid": "Ácido Carborano",
      "ATP": "ATP",
      "Nicotine": "Nicotina",
      "Aspirin": "Aspirina",
      "Caffeine": "Cafeína",
      "Sulfate": "Sulfato",
      "Nitrate": "Nitrato",
      "Ammonium": "Amônio",
      "Sodium Chloride": "Cloreto de Sódio",
      "Propane": "Propano",
      "Picene": "Piceno",
      "Octasulfur": "Octassulfeto",
      "Buckminsterfullerene": "Buckminsterfullerene"
    },

    "compound_types":
    [
      "ORGANICO",
      "BIOMOLECULA",
      "INORGANICO",
      "ION",
      "NANOMATERIAL",
      "ELEMENTOS"
    ],

    "compound_descriptions":
    {
      "Water": "A água (H2O) é vital para os organismos e os sistemas da Terra, sendo o 'solvente universal', dissolvendo substâncias para funções biológicas, regulando o clima com sua capacidade térmica, circulando entre sólido, líquido e gás, e moldando paisagens enquanto sustenta ecossistemas.",
      "Acetone": "A acetona (C3H6O) é a cetona mais simples, composta por três átomos de carbono, seis de hidrogênio e um de oxigênio. É um líquido incolor, volátil e inflamável, com odor característico adocicado. Mistura-se facilmente com água e muitos solventes orgânicos. A acetona é amplamente utilizada como solvente industrial e de laboratório, na produção de plásticos, fibras sintéticas e produtos farmacêuticos, além de ser componente comum em removedores de esmalte.",
      "Carbon Dioxide": "O dióxido de carbono (CO2) é um composto formado por um átomo de carbono ligado a dois átomos de oxigênio, presente naturalmente na atmosfera e essencial para processos vitais. Ele desempenha um papel fundamental na fotossíntese e é um gás de efeito estufa.",
      "Ethylene": "O etileno (C2H4), também chamado de eteno, é o alceno mais simples, composto por dois átomos de carbono ligados por uma dupla ligação e quatro átomos de hidrogênio. É um gás incolor e inflamável, com odor levemente adocicado. O etileno é um dos principais produtos da indústria petroquímica, usado como matéria-prima na produção de plásticos como o polietileno, além de atuar como hormônio vegetal que regula o amadurecimento de frutas.",
      "Acetylene": "O acetileno (C2H2), também chamado de etino, é o alcino mais simples, formado por dois átomos de carbono ligados por uma tripla ligação e dois átomos de hidrogênio. É um gás incolor e altamente inflamável, com odor característico. O acetileno é amplamente utilizado como combustível em maçaricos de soldagem e corte devido à sua chama quente e estável, além de servir como matéria-prima na síntese de compostos orgânicos.",
      "Ozone": "Ozônio (O3) é uma molécula triatômica composta por três átomos de oxigênio. Ocorre naturalmente na atmosfera terrestre, onde forma a camada de ozônio que protege os organismos vivos ao absorver a radiação ultravioleta nociva proveniente do Sol.",
      "Methane": "O metano (CH4), composto por um átomo de carbono ligado a quatro átomos de hidrogênio, é o principal componente do gás natural e uma importante fonte de energia. É um potente gás de efeito estufa.",
      "TNT": "O trinitrotolueno (C7H5N3O6), conhecido pela sigla TNT, é um composto orgânico pertencente à classe dos nitroaromáticos. É formado pela substituição de três grupos nitro (-NO2) no anel aromático do tolueno. Apresenta-se como um sólido amarelo, relativamente estável ao manuseio, mas altamente explosivo quando detonado. O TNT é amplamente utilizado em aplicações militares e industriais como explosivo padrão devido à sua facilidade de fabricação, estabilidade química e capacidade de armazenamento seguro.",
      "Carbon Monoxide": "O monóxido de carbono (CO) é um gás incolor, inodoro e insípido, composto por um átomo de carbono ligado a um átomo de oxigênio. É produzido pela combustão incompleta de combustíveis que contêm carbono, como madeira, carvão, gasolina e gás natural. O monóxido de carbono liga-se fortemente à hemoglobina no sangue, reduzindo o transporte de oxigênio e tornando-se altamente tóxico para humanos e animais.",
      "Nitroglycerin": "A nitroglicerina (C3H5N3O9) é um composto orgânico pertencente à classe dos ésteres de nitrato, formado pela esterificação do glicerol com ácido nítrico. Apresenta-se como um líquido oleoso, incolor a amarelado, altamente explosivo e sensível a choque e calor. É utilizada principalmente na fabricação de explosivos, como a dinamite, e também possui aplicações médicas em baixas doses como vasodilatador no tratamento de doenças cardíacas. Devido à sua instabilidade, requer armazenamento e manuseio extremamente cuidadosos.",
      "Glycerol": "O glicerol (C3H8O3), também conhecido como glicerina, é um álcool trihidroxílico composto por três átomos de carbono, oito de hidrogênio e três grupos hidroxila (-OH). Apresenta-se como um líquido viscoso, incolor, inodoro e de sabor adocicado. É higroscópico e miscível em água. O glicerol é amplamente utilizado na indústria farmacêutica e cosmética como umectante, na fabricação de explosivos como a nitroglicerina, em alimentos como aditivo e na produção de resinas e plásticos.",
      "Silicon Dioxide": "O dióxido de silício (SiO2), também conhecido como sílica, é um composto inorgânico formado por átomos de silício e oxigênio em proporção 1:2. Apresenta-se principalmente como um sólido cristalino, sendo o principal componente do quartzo e de muitas rochas e areias. É insolúvel em água e quimicamente estável. O dióxido de silício é amplamente utilizado na fabricação de vidro, cerâmica, cimento, semicondutores e como aditivo alimentar (antiaglomerante).",
      "Deoxyribose": "A desoxirribose (C5H10O4) é um monossacarídeo da classe das pentoses, semelhante à ribose, mas com a ausência de um átomo de oxigênio no carbono 2'. É o açúcar fundamental do DNA, formando a estrutura da desoxirribose-fosfato que compõe os nucleótidos. Apresenta-se como um sólido cristalino, solúvel em água, e é essencial para a estabilidade e função do DNA.",
      "Beta-D-Ribose": "A Beta-D-ribose (C5H10O5) é um monossacarídeo da classe das pentoses, com cinco átomos de carbono e um grupo aldeído. É um açúcar essencial presente no RNA, formando parte da estrutura da ribose-fosfato que compõe os nucleótidos. Apresenta-se como um sólido cristalino, altamente solúvel em água, desempenhando papel fundamental no metabolismo celular e na síntese de ácidos nucleicos.",
      "Ethane": "O etano (C2H6) é um hidrocarboneto saturado da série dos alcanos, composto por dois átomos de carbono ligados por ligação simples e cercados por seis átomos de hidrogênio. É um gás incolor e inodoro em condições padrão e ocorre naturalmente no petróleo e no gás natural.",
      "Pyrophosphoric Acid": "O ácido pirofosfórico (H4P2O7) é um composto inorgânico pertencente à classe dos oxiácidos do fósforo. É formado pela condensação de duas moléculas de ácido fosfórico com eliminação de uma molécula de água. Apresenta-se como um sólido cristalino ou solução viscosa, sendo um ácido tetraprótico capaz de doar quatro prótons em solução aquosa. É utilizado em síntese química, em formulações de detergentes e como intermediário na produção de fosfatos.",
      "Decane": "O decano (C10H22) é um hidrocarboneto da família dos alcanos, composto por dez átomos de carbono e vinte e dois de hidrogênio em uma cadeia linear. É um líquido incolor e inflamável, insolúvel em água, mas miscível com solventes orgânicos. O decano é utilizado como componente de combustíveis, especialmente na gasolina, e como solvente em processos industriais. Também serve como referência em estudos de química orgânica e físico-química devido às suas propriedades previsíveis dentro da série dos alcanos.",
      "Ethanol": "O etanol (C2H5OH) é um composto orgânico constituído por dois átomos de carbono, seis de hidrogênio e um de oxigênio, classificado como um álcool simples. É um líquido volátil, inflamável, com odor característico, amplamente usado como solvente, combustível e na produção de bebidas alcoólicas.",
      "Sodium Bicarbonate": "O bicarbonato de sódio (NaHCO3), também conhecido como sal de cozinha leve ou simplesmente bicarbonato, é um composto iônico formado por íons sódio (Na+) e bicarbonato (HCO3-). Apresenta-se como um pó branco cristalino, solúvel em água e de sabor levemente alcalino. É amplamente utilizado como agente fermentador em panificação, neutralizador de ácidos, produto de limpeza doméstico e em aplicações médicas para aliviar a acidez estomacal.",
      "Phosphoric Acid": "O ácido fosfórico (H3PO4) é um composto inorgânico pertencente à classe dos oxiácidos do fósforo. Apresenta-se como um sólido cristalino ou solução aquosa incolor, de sabor ácido. É amplamente utilizado na indústria de fertilizantes (como fonte de fósforo), em bebidas e alimentos como acidulante, na produção de detergentes e em tratamentos de superfície metálica. É um ácido moderado, triprótico, capaz de doar três prótons em solução aquosa.",
      "Thymine": "A timina (C5H6N2O2) é uma base nitrogenada pirimidínica encontrada no DNA. Forma pares de bases com a adenina por meio de duas ligações de hidrogênio. É essencial para a estabilidade da dupla hélice e para a correta replicação do material genético.",
      "Cytosine": "A citosina (C4H5N3O) é uma base nitrogenada pirimidínica presente tanto no DNA quanto no RNA. Forma pares de bases com a guanina por meio de três ligações de hidrogênio. É fundamental para a codificação genética e para a regulação epigenética através da metilação.",
      "Adenine": "A adenina (C5H5N5) é uma base nitrogenada purínica presente no DNA e no RNA. Forma pares de bases com a timina no DNA e com o uracilo no RNA, por meio de duas ligações de hidrogênio. Também participa em moléculas energéticas como o ATP.",
      "Guanine": "A guanina (C5H5N5O) é uma base nitrogenada purínica presente no DNA e no RNA. Forma pares de bases com a citosina através de três ligações de hidrogênio. É essencial para a estabilidade da dupla hélice e para a fidelidade da informação genética.",
      "Uracil": "O uracilo (C4H4N2O2) é uma base nitrogenada pirimidínica encontrada apenas no RNA. Substitui a timina na complementaridade de bases, formando pares com a adenina por meio de duas ligações de hidrogênio.",
      "Benzene": "O benzeno (C6H6) é um hidrocarboneto aromático formado por seis átomos de carbono dispostos em anel com ligações duplas alternadas, estabilizado por ressonância. É um líquido incolor, volátil, com odor doce, amplamente usado como precursor na produção de plásticos, resinas, fibras sintéticas e inúmeros compostos químicos.",
      "Cubane": "Cubano (C8H8) é um hidrocarboneto altamente tensionado, composto por oito átomos de carbono dispostos nos vértices de um cubo, cada um ligado a um átomo de hidrogênio. Apesar da intensa tensão angular, é surpreendentemente estável em condições normais. O cubano é um sólido cristalino incolor e desperta grande interesse em pesquisas, com potenciais aplicações em materiais de alta energia, farmacêuticos e síntese química avançada.",
      "Cuban-cetamol": "O Cuban-cetamol é um análogo hipotético do paracetamol baseado em cubano, criado pela substituição do anel aromático de benzeno por uma estrutura cúbica de cubano. Ele combina o núcleo hidrocarboneto altamente tensionado com grupos hidroxila e acetamida, imitando as funções químicas do paracetamol.",
      "Propane": "O propano (C3H8) é um hidrocarboneto da família dos alcanos, composto por três átomos de carbono e oito de hidrogênio. É um gás incolor e inodoro em sua forma pura, mas geralmente recebe aditivos para ter cheiro característico e facilitar a detecção de vazamentos. O propano é amplamente utilizado como combustível em aquecimento, cozinhas, motores e em sistemas de gás liquefeito de petróleo (GLP). Também serve como matéria-prima na indústria química. Por ser inflamável, requer armazenamento e manuseio cuidadosos.",
      "Calcium Hydroxide": "O hidróxido de cálcio (Ca(OH)2), também conhecido como cal hidratada ou cal apagada, é um composto inorgânico formado por íons cálcio (Ca2+) e hidróxido (OH-). Apresenta-se como um sólido branco, pouco solúvel em água, mas capaz de formar uma solução alcalina chamada água de cal. É amplamente utilizado na construção civil (na preparação de argamassas e revestimentos), no tratamento de águas e esgotos, na indústria alimentícia como regulador de acidez e na agricultura para corrigir solos ácidos.",
      "Hydrogen Peroxide": "Hydrogen peroxide (H2O2) is a chemical compound composed of two hydrogen atoms and two oxygen atoms. It is a colorless liquid, slightly more viscous than water, with strong oxidizing properties. It is widely used as a disinfectant, bleaching agent, and in industrial processes. In dilute solutions, it is used for cleaning and medical care.",
      "Hydronium": "O íon hidrônio (H3O+) é um cátion formado quando uma molécula de água (H2O) recebe um próton (H+). É fundamental na química ácido-base, representando a forma hidratada do próton em soluções aquosas. O hidrônio é responsável pela acidez das soluções, participando de reações químicas e influenciando o pH. Embora não exista como molécula isolada em condições normais, é estabilizado pela solvatação em água e desempenha papel central em processos biológicos e químicos.",
      "Nitrogen": "O nitrogênio (N2) é uma molécula diatômica composta por dois átomos de nitrogênio unidos por uma forte ligação tripla, tornando-o quimicamente estável e inerte na maioria das condições. É um gás incolor e inodoro que constitui cerca de 78% da atmosfera terrestre.",
      "Oxygen": "O oxigênio (O2) é uma molécula diatômica essencial para a vida, composta por dois átomos de oxigênio. É um gás incolor e inodoro que representa cerca de 21% da atmosfera terrestre. O oxigênio é vital para a respiração celular na maioria dos organismos e sustenta a combustão. Embora necessário para a sobrevivência, concentrações muito altas podem ser tóxicas e níveis baixos podem causar hipóxia.",
      "C20 Fullerene": "O fulereno C20 é o menor fulereno, formado por 20 átomos de carbono em uma estrutura em forma de gaiola dodecaédrica. Sua alta tensão o torna menos estável que fulerenos maiores, como o C60.",
      "Cyclohexane": "O ciclo-hexano (C6H12) é um hidrocarboneto cíclico saturado formado por seis átomos de carbono dispostos em anel, cada um ligado a dois átomos de hidrogênio. É um líquido incolor, inflamável e de odor suave, amplamente utilizado como solvente e na produção de nylon e outros produtos químicos industriais.",
      "Sulfuric Acid": "O ácido sulfúrico (H2SO4) é um ácido mineral forte composto por hidrogênio, enxofre e oxigênio. É um líquido denso e oleoso, altamente corrosivo, amplamente utilizado na indústria para produção de fertilizantes, síntese química, refino de petróleo e como eletrólito em baterias.",
      "Sodium Hydroxide": "O hidróxido de sódio (NaOH), também conhecido como soda cáustica ou lixívia, é um composto iônico formado por íons sódio (Na+) e hidróxido (OH-). É um sólido branco, altamente higroscópico e solúvel em água, liberando grande quantidade de calor ao se dissolver. O hidróxido de sódio é uma base forte, amplamente utilizado em processos industriais como fabricação de papel, sabão, detergentes, produtos químicos e no tratamento de águas residuais.",
      "Vitamin A": "A vitamina A (C20H30O) é uma vitamina lipossolúvel essencial para a visão, função imunológica e crescimento celular. Aparece em várias formas, incluindo retinol, retinal e ácido retinoico, sendo obtida de fontes animais e de carotenoides presentes em plantas.",
      "Methanol": "O metanol (CH3OH) é o álcool mais simples, composto por um grupo metíl e um grupo hidroxila. É um líquido incolor, volátil e inflamável, com odor levemente adocicado. Mistura-se completamente com água e é amplamente utilizado como solvente, combustível, especialmente na produção de formaldeído e ácido acético. Apesar de sua importância industrial, o metanol é altamente tóxico para humanos, podendo causar cegueira, danos aos órgãos ou morte quando ingerido ou inalado em grandes quantidades.",
      "Ammonia": "A amônia (NH3) é um composto inorgânico de nitrogênio e hidrogênio, um gás incolor com odor forte e pungente. É essencial em fertilizantes, serve como bloco de construção para muitos produtos químicos e desempenha papel em processos biológicos como o metabolismo de proteínas.",
      "Formaldehyde": "O formaldeído (CH2O) é o aldeído mais simples, um gás incolor e pungente que polimeriza facilmente. É amplamente usado em resinas, desinfetantes, conservantes e como precursor em síntese química, embora seja tóxico e carcinogênico em altas exposições.",
      "Pyridine": "Piridina (C5H5N) é um composto aromático heterocíclico contendo um átomo de nitrogênio no anel. É um líquido incolor, com odor característico, usado como solvente e intermediário químico. A piridina é fundamental na síntese de medicamentos, agroquímicos e vitaminas, além de servir como base em diversas reações orgânicas devido à sua capacidade de aceitar prótons.",
      "Acetic Acid": "O ácido acético (CH3COOH) é um ácido carboxílico, principal componente do vinagre, conferindo-lhe sabor azedo e odor forte. É um importante produto químico industrial usado na produção de plásticos, solventes e alimentos, além de desempenhar papel no metabolismo.",
      "Isobutyric Acid": "O ácido isobutírico ((CH3)2CHCOOH), também conhecido como ácido 2-metilpropanoico, é um ácido graxo de cadeia curta ramificado com odor rancoso semelhante a manteiga. Ocorre naturalmente em alguns alimentos e é usado em aromatizantes, perfumes e como intermediário químico.",
      "Butanoic Acid": "O ácido butanoico (C4H8O2), também conhecido como ácido butírico, é um ácido carboxílico de cadeia curta com odor rançoso semelhante ao de manteiga ou vômito. Ocorre naturalmente em produtos lácteos e é produzido por bactérias intestinais. O ácido butanoico contribui para sabores em alguns alimentos e desempenha funções no metabolismo energético e na saúde intestinal. Também é utilizado na fabricação de ésteres para perfumes e aromatizantes.",
      "Alanine": "A alanina (C3H7NO2) é um alpha-aminoácido não essencial com cadeia lateral metil, usado na biossíntese de proteínas. Desempenha papéis importantes no metabolismo, incluindo o ciclo glicose-alanina, e serve como fonte de energia para músculos e cérebro.",
      "Beta-D-Glucose": "A beta-D-glicose (C6H12O6) é um monossacarídeo e o anômero beta da glicose, principal fonte de energia na biologia. Forma o bloco de construção da celulose nas plantas e é crucial no metabolismo de carboidratos e na produção de energia.",
      "Palmitic Acid": "O ácido palmítico (C16H32O2) é um ácido graxo saturado de cadeia longa, abundante no óleo de palma, gorduras animais e tecidos humanos. É um componente principal das membranas celulares e usado em sabões, cosméticos e produção de alimentos.",
      "Capric Acid": "O ácido cáprico (C10H20O2), também conhecido como ácido decanóico, é um ácido graxo saturado com uma cadeia de 10 carbonos. Ocorre naturalmente no óleo de coco, no óleo de palmiste e no leite de vacas e cabras. O ácido cáprico é um sólido cristalino branco com ponto de fusão em torno de 31 °C e ponto de ebulição próximo de 270 °C. Possui um odor característico semelhante ao de cabras, de onde deriva seu nome (do latim 'caper/capra').",
      "Oleic Acid": "O ácido oleico (C18H34O2) é um ácido graxo monoinsaturado com uma cadeia de 18 carbonos e uma ligação dupla cis no nono carbono (ômega-9). É o ácido graxo mais abundante na natureza, encontrado em óleos vegetais como o azeite de oliva, óleo de canola e em gorduras animais. O ácido oleico é um líquido incolor a amarelado em temperatura ambiente, insolúvel em água mas solúvel em solventes orgânicos.",
      "Cholesterol": "O colesterol (C27H46O) é um esterol essencial para as membranas celulares e a produção de hormônios. Embora vital, o excesso de colesterol no sangue pode causar acúmulo de placas nas artérias, aumentando o risco de doenças cardíacas e derrames.",
      "Diamond": "O diamante é um alótropo metaestável do carbono com uma rede cúbica de face centrada. É o material natural mais duro conhecido e um excelente condutor térmico.",
      "Paracetamol": "O paracetamol (C8H9NO2), também conhecido como acetaminofeno, é um analgésico e antipirético comum. Ele alivia a dor e reduz a febre, mas apresenta efeitos anti-inflamatórios mínimos em comparação aos AINEs.",
      "Heme A": "O grupo heme (C34H32N4O4) é o grupo prostético que contém ferro presente na hemoglobina e na mioglobina. Ele se liga reversivelmente ao oxigênio e dá ao sangue sua cor vermelha.",
      "DPPC": "A dipalmitoilfosfatidilcolina (C40H80NO8P) é um fosfolipídio importante presente no surfactante pulmonar e nas membranas celulares. Ela é composta por uma espinha dorsal de glicerol ligada a duas cadeias de ácido palmítico e a um grupo fosfocolina. Essa estrutura anfipática permite a formação de bicamadas estáveis, reduzindo a tensão superficial nos pulmões e possibilitando uma troca eficiente de gases.",
      "Sucrose": "A sacarose (C12H22O11) é um dissacarídeo formado pela união das unidades de glicose e frutose através de uma ligação glicosídica. Conhecida popularmente como açúcar de mesa, é um sólido cristalino incolor de sabor doce. A sacarose é amplamente utilizada como adoçante em alimentos e bebidas e desempenha papel importante como fonte de energia na nutrição humana e no metabolismo das plantas.",
      "Carbon Nanotube": "Os nanotubos de carbono são nanostruturas cilíndricas formadas por folhas de grafeno enroladas. Eles apresentam resistência mecânica extraordinária e propriedades elétricas notáveis.",
      "Carborane Acid": "Ácido carborano (H(CHB11Cl11)), também conhecido como superácido semelhante ao fluoroantimônico, é um dos ácidos de Brønsted mais fortes já conhecidos. Ele consiste em um próton ligado a um ânion carborano, que é notavelmente estável e fracamente coordenante. Diferente dos ácidos convencionais, não corrói vidro e pode protonar bases extremamente fracas.",
      "ATP": "A adenosina trifosfato (ATP, C10H16N5O13P3) é um nucleotídeo formado por adenina, ribose e três grupos fosfato. É a principal molécula de energia das células vivas, armazenando e transferindo energia para processos biológicos como contração muscular, transmissão de impulsos nervosos e síntese de biomoléculas. A ATP é continuamente regenerada a partir de ADP e fosfato durante a respiração celular e a fotossíntese, sendo essencial para a vida.",
      "Nicotine": "A nicotina (C10H14N2) é um alcaloide natural encontrado nas plantas de tabaco. Atua como estimulante ao se ligar aos receptores nicotínicos de acetilcolina no cérebro.",
      "Aspirin": "A aspirina (C9H8O4), ou ácido acetilsalicílico, é um derivado sintético do ácido salicílico usado como analgésico, anti-inflamatório, antipirético e antiagregante plaquetário. Inibe enzimas ciclo-oxigenases para reduzir dor, febre e coagulação sanguínea.",
      "Caffeine": "A cafeína (C8H10N4O2) é um alcaloide metilxantina, composto cristalino branco e amargo que atua como estimulante do sistema nervoso central. Encontrada no café, chá e cacau, bloqueia receptores de adenosina para promover alerta.",
      "Sulfate": "O sulfato (SO4(-2)) é um ânion poliatômico com um átomo central de enxofre ligado a quatro átomos de oxigênio em geometria tetraédrica. Forma muitos sais, essencial na biologia, indústria (ex.: detergentes, fertilizantes) e como nutriente em ecossistemas.",
      "Nitrate": "O nitrato (NO3(-)) é um ânion poliatômico com um átomo central de nitrogênio ligado a três átomos de oxigênio em geometria trigonal planar. É fundamental em fertilizantes, explosivos e processos biológicos, servindo como fonte de nitrogênio para plantas.",
      "Ammonium": "O íon amônio (NH4+) é um cátion poliatômico formado quando a amônia (NH3) recebe um próton. Ele desempenha um papel central no metabolismo do nitrogênio, atuando como intermediário na assimilação de nitrogênio por plantas e microrganismos. Os sais de amônio são amplamente utilizados em fertilizantes, explosivos e processos industriais, e em soluções aquosas contribuem para o equilíbrio ácido-base.",
      "Sodium Chloride": "Cloreto de sódio (NaCl), conhecido popularmente como sal de cozinha, é um composto iônico formado pela união de íons sódio (Na+) e cloreto (Cl-). Essencial para a vida, desempenha papel fundamental na manutenção do equilíbrio hídrico, na transmissão nervosa e na contração muscular dos organismos vivos. Além de sua importância biológica, o cloreto de sódio é amplamente utilizado como tempero e conservante de alimentos.",
      "Picene": "O piceno (C22H14) é um hidrocarboneto aromático policíclico composto por cinco anéis benzênicos fundidos em uma disposição em zigue-zague. É um sólido cristalino com baixa solubilidade em água, estudado por suas propriedades eletrônicas e ópticas. O piceno tem despertado interesse em ciência dos materiais e eletrônica orgânica.",
      "Octasulfur": "O octassulfeto (S8) é a forma mais estável e comum do enxofre elementar, composto por oito átomos de enxofre dispostos em um anel ondulado. É um sólido cristalino amarelo brilhante, insolúvel em água mas solúvel em solventes orgânicos. O octassulfeto ocorre naturalmente em regiões vulcânicas e é amplamente utilizado na produção de ácido sulfúrico, fertilizantes, vulcanização da borracha e diversos processos industriais.",
      "Buckminsterfullerene": "Buckminsterfullerene (C60) é um fulereno esférico composto por 60 átomos de carbono dispostos em um icosaedro truncado (padrão de bola de futebol). Descoberto em 1985 e nomeado em homenagem a Buckminster Fuller devido à sua estrutura semelhante a uma cúpula geodésica."
    }
  },

  "Simulation": 
  {
    "universe_ui":
    {
      "stats":
      {
        "title": "Estatisticas do Universo",
        
        "core_stats":
        {
          "title": "Estatisticas Centrais",
          "temperature": "Temperatura",
          "pressure": "Pressão (Kpa)",
          "time": "Tempo",
          "particles": "Partículas",
          "molecules": "Moléculas",
          "slider_temperature": "T Alvo (K):",
          "slider_pressure": "P Alvo (Kpa):"
        },
        "energy_stats":
        {
          "title": "Energia & Cinéticas",
          "kinetic_energy": "Energia cinética",
          "potential_energy": "Energia potencial",
          "total_energy": "Energia total"
        },
        "graphs_stats":
        {
          "title": "Gráficos & Plotagens",
          "warning": "Frames precisam ser gravados em ordem para os graficos funcionarem!",
          "temperature_v_time": "Temperatura X Tempo"
        }
      },

      "tooltip_resume": "Resumir a Simulação",
      "tooltip_pause": "Pausar a Simulação",
      "tooltip_speedup": "Aumentar velocidade da simulação",
      "tooltip_slowdown": "Diminuir velocidade da simulação",
      "tooltip_screenshot": "Tirar uma foto",
      "tooltip_scenario_disabled": "Disabilitado devido ao Cenário",
      "tooltip_compound_selector": "Adicionar Composto",
      "tooltip_emplace_molecule": "Aperte (G) para posicionar a Molécula,\n(Mouse Direito) para cancelar.\nSegure (Shift) para continuar.",
      "tooltip_collision_good": "Boa Posição",
      "tooltip_collision_bad": "Colisão Detectada!",

      "video_controller":
      {
        "play_tooltip": "Resumir o Video",
        "pause_tooltip": "Pausar o Video",
        "restart_tooltip": "Recomeçar o Video",
        "record_start_tooltip": "Começar a Gravar",
        "record_stop_tooltip": "Parar de Gravar",
        "play_speed": "Velocidade de rolagem"
      },

      "compound_selector":
      {
        "title": "Selecionador de Compostos",
        "button_add": "Adicionar Composto",
        "molar_weight": "M.M",
        "formula": "Formula",

        "tooltip_fullview": "Abra a visão detalhada",

        "full_view":
        {
          "close": "Fechar",
          "preview": "Chem Chards TM",
          "description": "Descrição",
          "add_simulation": "Adicionar para a Simulação"
        },

        "periodic_title": "Tabela Periódica",
        "periodic_subtitle": "dos Elementos",
        "periodic_names": 
        [
          ["Hidrogênio", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "Hélio"],
          ["Lítio", "Berílio", "", "", "", "", "", "", "", "", "", "", "Boro", "Carbono", "Nitrogênio", "Oxigênio", "Flúor", "Neônio"],
          ["Sódio", "Magnésio", "", "", "", "", "", "", "", "", "", "", "Alumínio", "Silício", "Fósforo", "Enxofre", "Cloro", "Argônio"],
          ["Potássio", "Cálcio", "Escândio", "Titânio", "Vanádio", "Cromo", "Manganês", "Ferro", "Cobalto", "Níquel", "Cobre", "Zinco", "Gálio", "Germânio", "Arsênio", "Selênio", "Bromo", "Criptônio"],
          ["Rubídio", "Estrôncio", "Ítrio", "Zircônio", "Nióbio", "Molibdênio", "Tecnécio", "Rutênio", "Ródio", "Paládio", "Prata", "Cádmio", "Índio", "Estanho", "Antimônio", "Telúrio", "Iodo", "Xenônio"],
          ["Césio", "Bário", "Lantânio", "Háfnio", "Tântalo", "Tungstênio", "Rênio", "Ósmio", "Irídio", "Platina", "Ouro", "Mercúrio", "Tálio", "Chumbo", "Bismuto", "Polônio", "Astato", "Radônio"],
          ["Frâncio", "Rádio", "Actínio", "Rutherfórdio", "Dúbnio", "Seabórgio", "Bóhrio", "Hássio", "Meitnério", "Darmstádio", "Roentgênio", "Copernício", "Nihônio", "Fleróvio", "Moscóvio", "Livermório", "Tennessínio", "Oganessônio"],
          ["", "", "Cério", "Praseodímio", "Neodímio", "Promécio", "Samário", "Eurípio", "Gadolínio", "Térbio", "Disprósio", "Hólmio", "Érbio", "Túlio", "Itérbio", "Lutécio", "", ""],
          ["", "", "Tório", "Protactínio", "Urânio", "Netúnio", "Plutônio", "Américo", "Cúrio", "Berquélio", "Califórnio", "Einsteinio", "Férmio", "Mendelévio", "Nobélio", "Laurêncio", "", ""]
        ]
      }
    },
    "pause_menu":
    {
      "title": "Menu de Pausa",
      "button_resume": "Resumir Simulação",
      "button_restart": "Recomeçar Simulação",
      "button_save": "Salvar a Simulação",
      "button_load": "Carregar a Simulação",
      "button_options": "Opções",
      "button_exit_menu": "Sair para o Menu",
      "simulation_name": "Nome da Simulação:",
      "warning": "Aviso! Todo progresso não salvo será Perdido!",
      "true_exit": "Sair",
      "cancel": "Cancelar",
      "button_exit_desktop": "Sair para o Desktop",
      "hint_esc": "Aperte ESC novamente para resumir"
    },
    "narration_menu":
    {
      "button_next": "Próximo",
      "button_previous": "Anterior",
      "button_exit": "Sair",
      "button_close": "Fechar",
      "steps": "etapas"
    }
  },

  "Scenarios": 
  {
    "SCENARIO_MOLECULES_Water": 
    {
      "description": "A molécula de água (H2O) - formato angular por causa dos pares solitários, com ângulo real de 104,5°. A base das ligações de hidrogênio e da vida como conhecemos.",
      "narrations": 
      [
        "Esta é a molécula de água - H2O. Um átomo de oxigênio ligado a dois átomos de hidrogênio.",
        "Repare que o formato não é linear. Os dois hidrogênios estão dobrados um em direção ao outro. Por quê? Porque o oxigênio tem dois pares de elétrons solitários que repelem os pares de ligação.",
        "Segundo a teoria VSEPR, o oxigênio tem quatro domínios eletrônicos: dois pares ligantes e dois pares solitários. Esses quatro domínios se organizam em geometria tetraédrica para ficarem o mais afastados possível.",
        "Mas o formato molecular só conta os átomos - então vemos uma molécula angular ou em V.",
        "O ângulo tetraédrico ideal seria 109,5°, mas os pares solitários empurram mais forte que os pares de ligação, reduzindo o ângulo H-O-H para 104,5° na vida real.",
        "Essa pequena diferença faz uma diferença enorme - é por isso que a água é polar, forma ligações de hidrogênio, dissolve tantas substâncias e torna a vida possível.",
        "Água - simples, mas extraordinária."
      ]
    },
    "SCENARIO_MOLECULES_Benzene": 
    {
      "description": "Benzeno (C6H6) - o clássico anel aromático. Cada carbono tem ângulo de ligação de 120° e os elétrons estão deslocalizados, dando ao composto estabilidade excepcional.",
      "narrations": 
      [
        "Este é o benzeno - C6H6 - uma das moléculas mais famosas e importantes da química.",
        "Observe os seis átomos de carbono dispostos em um hexágono perfeito. Cada carbono está ligado a dois outros carbonos e um hidrogênio.",
        "O ângulo de ligação em cada carbono é exatamente 120° - essa é a assinatura da geometria trigonal planar.",
        "Mas o benzeno é especial. Os seis elétrons pi não ficam presos entre pares de carbonos - eles estão deslocalizados ao redor de todo o anel.",
        "Essa deslocalização é frequentemente representada por um círculo dentro do hexágono. Isso torna a molécula muito mais estável do que se tivesse três ligações duplas separadas.",
        "Essa estabilidade é chamada de aromaticidade. É por isso que o benzeno não reage como um alceno comum e por que tantas moléculas importantes contêm anéis benzenicos.",
        "Benzeno - simples, simétrico e incrivelmente estável."
      ]
    },   
    "SCENARIO_MOLECULE_CarbonDioxide": 
    {
      "description": "Dióxido de carbono (CO2) - uma molécula linear com ângulos de ligação de 180°. Uma molécula simples, mas crucial para a vida e para o clima.",
      "narrations": 
      [
        "Este é o dióxido de carbono - CO2. Um átomo de carbono ligado por duplas ligações a dois átomos de oxigênio.",
        "Observe o formato perfeitamente reto e linear. Os dois oxigênios estão exatamente opostos um ao outro em relação ao carbono.",
        "Segundo a teoria VSEPR, o carbono tem dois domínios eletrônicos - ambos são pares ligantes (ligações duplas contam como um domínio cada). Dois domínios se organizam o mais afastados possível: 180° de distância.",
        "O resultado é uma geometria molecular linear com ângulo de ligação de exatamente 180°.",
        "Essa linearidade é o motivo pelo qual o CO2 é apolar, mesmo tendo ligações polares - os dipolos se cancelam perfeitamente.",
        "O CO2 tem um papel enorme no mundo: as plantas o usam na fotossíntese, ele retém calor na atmosfera como gás de efeito estufa, e é o que exalamos.",
        "Estrutura simples, impacto gigantesco."
      ]
    },
    "SCENARIO_DYNAMICS_DropletFormation": 
    {
      "description": "Veja átomos neutros se condensarem de um gás caótico para lindas gotículas líquidas - uma demonstração impressionante de como as forças de van der Waals criam líquidos a partir de partículas espalhadas.",
      "narrations": 
      [
        "Este é o cenário de Formação de Gotículas. Você está vendo algo realmente especial: como um gás quente e desorganizado se transforma em gotículas líquidas organizadas.",
        "Começamos com 150 átomos de argônio a alta temperatura - cerca de 1000 K. Eles estão voando rápido, colidindo aleatoriamente... puro comportamento de gás, sem nenhuma ordem.",
        "Agora o resfriamento começa. À medida que a temperatura cai, os átomos desaceleram... e algo bonito começa a acontecer. Pequenas regiões mais densas aparecem!",
        "Esses pequenos agrupamentos estão crescendo porque as forças de van der Waals estão puxando suavemente os átomos uns para os outros sempre que eles ficam próximos o suficiente. A atração é fraca, mas com partículas suficientes, ela fica poderosa.",
        "Observe as gotículas pequenas começando a se encontrar... e quando duas se tocam, elas se fundem rapidamente em uma gotícula maior. Esse processo é chamado de coalescência - é exatamente como as gotas de chuva crescem nas nuvens.",
        "Agora temos menos gotículas, mas bem maiores.",
        "E aqui está o resultado final: algumas gotas grandes e arredondadas. Toda a nuvem de gás dispersa se transformou em vários esferoides líquidos - tudo graças àquelas fracas atrações entre átomos neutros.",
        "É assim que os líquidos se formam no mundo real: gases condensam, gotículas se fundem e, eventualmente, surgem oceanos, lagos e chuva. As forças de van der Waals podem ser pequenas, mas moldam todo o mundo líquido ao nosso redor.",
        "Incrível de assistir, não é? Uma das transformações mais elegantes da natureza - do caos para a ordem, apenas resfriando."
      ]
    },
    "SCENARIO_DYNAMICS_Brownian_Motion":
    {
      "description": "Neste cenário, você verá partículas em movimento aleatório, um exemplo clássico do movimento browniano.",
      "narrations":
      [
        "Bem-vindo(a) ao Cenário de Movimento Browniano! Neste cenário, veremos o movimento browniano e o que ele significa. Há um átomo de Oganessônio (Z=118) com gas hélio (Z=2) ao redor.",
        "Mas o que exatamente é o Movimento Browniano?\nÉ o movimento aleatório e agitado de partículas causado por inúmeras colisões com moléculas ao redor. Esses impactos invisíveis fazem as partículas se moverem de forma imprevisível, uma dança microscópica impulsionada pela energia térmica.\n(Ative o modo preenchedor de espaço para ter uma visão melhor!)"
      ]
    },
    "SCENARIO_DYNAMICS_AtmosphereLayers": 
    {
      "description": "Veja a composição da atmosféra terrestre, e aprenda sobre porque existem camadas.",
      "narrations": 
      [
        "Este é o cenário de Camadas Atmosféricas.",
        "Começamos com uma mistura aleatória de moléculas do ar - principalmente nitrogênio (N2), oxigênio (O2), argônio (Ar) e uma pitada de dióxido de carbono e metano.",
        "No início tudo parece uniforme - moléculas voando por igual em todos os lugares.",
        "Mas a gravidade (Na Vida Real, não neste cenário) está puxando para baixo. Com o tempo, as moléculas mais pesadas (como argônio e CO2) começam a afundar para o fundo.",
        "As moléculas mais leves (principalmente N2 e O2) ficam mais altas ou são empurradas para cima pelas colisões.",
        "Depois de um tempo, você começa a ver camadas bem definidas - gás mais denso embaixo, gás mais rarefeito em cima.",
        "É exatamente o que acontece na atmosfera da Terra: gases mais pesados se concentram mais baixo, os mais leves ficam mais alto - criando a estrutura em camadas em que vivemos.",
        "Mesmo sendo forças pequenas, com o tempo a gravidade separa tudo por massa. Lindo, não é?",
        "Uma caixa simples, um pouco de gravidade, e a atmosfera começa a parecer... uma atmosfera de verdade."
      ]
    },
    "TUTORIAL_ENGINE_Controls": 
    {
      "description": "Domine os controles básicos: mova a câmera, pause o tempo, adicione compostos e muito mais.",
      "narrations": 
      [
        "Bem-vindo ao tutorial de Controles!\nVamos aprender rapidinho tudo o que você precisa para explorar e interagir com a simulação.",
        "Use **WASD** para mover a câmera para frente, trás, esquerda e direita.\nSegure o **botão direito do mouse** e arraste para olhar ao redor e girar a visão.\nExperimente agora - mexa um pouco!",
        "Ótimo! Agora vamos adicionar algo.\nPressione **Q** ou clique no **botão +** na barra inferior para abrir o selecionador de compostos.\nEsse é o selecionador de compostos. Você pode escolher entre várias moléculas - mais serão adicionadas em cada atualização.\nClique na **lupa** ao lado de qualquer composto para ver uma prévia maior e detalhes.",
        "Você pode adicionar compostos enquanto a simulação está rodando... mas às vezes é mais fácil quando tudo está parado.\nPressione **ESPAÇO** para pausar e retomar a simulação.",
        "Quando pausado, as moléculas congelam - perfeito para inspecionar estruturas, adicionar compostos ou estudar um momento específico.\nOlhe ao redor livremente, depois aperte **ESPAÇO** novamente para continuar.",
        "Você também pode controlar a velocidade do tempo: use as setas na barra inferior para acelerar ou desacelerar.\nExperimente acelerar um pouco! (Aviso: Acelerar demais pode causar instabilidade na simulação!)",
        "Pronto! Esse é o básico.\nAgora você já pode explorar, construir e experimentar à vontade.\nClique em **Sair** para terminar o tutorial - ou fique mais um pouco brincando!"
      ]
    },
    "TUTORIAL_CLASSICAL_VanDerWaals": 
    {
      "description": "Explore as forças de van der Waals: descubra por que átomos neutros se atraem a médias distâncias e se repelem fortemente quando muito próximos - a razão oculta por trás de líquidos, sólidos e da 'cola' do dia a dia.",
      "narrations": 
      [
        "Bem-vindo ao tutorial sobre Forças de van der Waals!\nHoje você vai conhecer uma das forças fracas mais importantes da natureza e entender por que os átomos se comportam como se comportam.",
        "Aqui temos dois átomos de argônio neutros. Sem nenhuma carga elétrica. Então... por que eles estão se aproximando devagar? Vamos rodar a simulação e observar com atenção.",
        "Olha só - eles estão sendo puxados um para o outro... mas, quando chegam bem perto, de repente se repelem com força!\nEssa atração seguida de forte repulsão é exatamente o que chamamos de **força de van der Waals**.",
        "Como dois átomos neutros podem se atrair? Mesmo sem carga líquida, as nuvens de elétrons estão sempre em movimento. Em um dado instante, um lado pode ficar ligeiramente mais negativo - criando um **dipolo induzido temporário**. O outro átomo responde deslocando seus elétrons também... e cargas opostas se atraem. Essa é a **atração de van der Waals**.",
        "Agora vamos adicionar mais... por diversão e ciência!",
        "Existe uma distância perfeita em que atração e repulsão se equilibram exatamente - ela é chamada de **distância de equilíbrio** (cerca de 3,8 Å para o argônio). Nessa distância a força resultante é quase zero e os átomos ficam bem acomodados. É por isso que as moléculas têm um 'tamanho natural' e não colapsam umas nas outras.",
        "Quando as nuvens de elétrons se sobrepõem demais, entra em ação o **princípio de exclusão de Pauli**: dois elétrons com o mesmo estado quântico não podem ocupar exatamente o mesmo lugar. O custo energético fica enorme - então os átomos se empurram com muita força!",
        "Essa repulsão forte é o motivo pelo qual nada realmente “encosta” no sentido clássico - tudo são forças!\nAs forças de van der Waals são fracas individualmente, mas estão em tudo: seguram os líquidos juntos, permitem que lagartixas escalem paredes lisas, criam tensão superficial e até fazem a tela do celular parecer suave ao toque.",
        "Agora, para demonstrar como essa força é fraca, vamos aumentar a temperatura. Saiba que a simulação está rodando a 500 fs/s e a 2.0 Kelvin - bem frio!",
        "Agora que aumentamos a temperatura, a força não consegue mais segurar as partículas juntas. O argônio sólido virou gás rapidamente... e agora a 30 fs/s.",
        "E congelar novamente!",
        "É isso a força de van der Waals em ação.\nVocê acabou de ver uma das razões fundamentais pelo comportamento que a matéria tem no dia a dia. Parabéns!"
      ]
    },
    "TUTORIAL_CLASSICAL_CoulombForce": 
    {
      "description": "Veja como partículas carregadas interagem por meio das forças de Coulomb: cargas opostas se atraem fortemente, cargas iguais se repelem violentamente. A base da ligação iônica, dos sais e de muito da química.",
      "narrations": 
      [
        "Bem-vindo ao tutorial de Forças de Coulomb! Essa é uma das forças mais fortes do dia a dia no universo - e tudo tem a ver com cargas elétricas. Vamos ver ela em ação.",
        "Aqui temos dois íons: um íon de sódio carregado positivamente (Na+ azul) e um íon de cloreto carregado negativamente (Cl- verde). Eles estão bem afastados... mas observe com atenção. O que você acha que vai acontecer?",
        "Nossa - eles correm um em direção ao outro muito rápido! Cargas opostas se atraem com uma força muito poderosa. Quanto mais perto ficam, mais forte fica a atração - é exatamente a lei de Coulomb em ação: a força aumenta com 1/distância ao quadrado.",
        "Agora vamos tentar dois íons com a mesma carga: dois íons de sódio (Na+ e Na+).",
        "Observe... eles se empurram violentamente para longe! Cargas iguais se repelem - e quanto mais perto estão, mais forte é o empurrão.",
        "Esse empurra-empurra é o motivo pelo qual os sais existem. Metais como o sódio doam elétrons e ficam positivos; ametais como o cloro aceitam elétrons e ficam negativos. Cargas opostas então os mantêm bem presos um ao outro.",
        "Veja o que acontece quando muitos deles se juntam: um cristal de cloreto de sódio (sal de cozinha). Observe o lindo padrão repetitivo - íons positivos e negativos se alternando em uma grade perfeita. Essa é a configuração de menor energia e mais estável.",
        "Mas e quando colocamos água? As moléculas de água têm suas próprias cargas pequenas - o oxigênio é ligeiramente negativo, os hidrogênios ligeiramente positivos. Elas rodeiam e blindam os íons, enfraquecendo a atração entre Na+ e Cl-.",
        "É exatamente por isso que o sal se dissolve na água: as moléculas de água puxam os íons para longe uns dos outros e os mantêm separados. O cristal se desfaz - o sal 'desaparece' na solução, mesmo que os íons ainda estejam lá.",
        "As forças de Coulomb estão em todos os lugares: mantêm os compostos iônicos unidos, controlam como as proteínas se dobram, fazem seus nervos enviarem sinais e alimentam baterias. É uma das quatro forças fundamentais que moldam o mundo ao nosso redor.",
        "Você acabou de ver como a carga cria ordem e estrutura na matéria. Excelente trabalho - agora você entende a força de Coulomb!"
      ]
    },
    "TUTORIAL_CLASSICAL_Phases": 
    {
      "description": "Veja como a temperatura muda a matéria de gás para líquido e depois para sólido - uma demonstração fundamental das transições de fase e das forças que mantêm os materiais unidos.",
      "narrations": 
      [
        "Bem-vindo ao tutorial de Transições de Fase! Aqui vamos assistir a matéria mudar de estado - de gás para líquido e depois para sólido - apenas variando a temperatura.",
        "Começamos com partículas a temperatura bem alta. Elas se movem rápido e se espalham por todo lado... essa é a fase gasosa: sem estrutura, só movimento aleatório.",
        "Agora vamos abaixar a temperatura devagar. As partículas desaceleram... e algo interessante começa. Pequenos grupos mais densos aparecem - as primeiras gotículas líquidas!",
        "Continuando o resfriamento, essas gotículas crescem e se juntam. Logo o sistema inteiro vira um líquido contínuo e uniforme. Isso é a condensação - as forças de atração entre partículas finalmente vencem a energia térmica.",
        "Resfriamos ainda mais. O líquido começa a se organizar... surgem regiões ordenadas que vão crescendo. Esses são os primeiros núcleos de cristal se formando!",
        "Veja o cristal se espalhar. As partículas se arrumam em um padrão regular e repetitivo - uma rede sólida. Na fase sólida, as partículas vibram no lugar, mas ficam presas em uma estrutura ordenada.",
        "Essa é a história básica das transições de fase: a temperatura decide se a matéria é gás, líquido ou sólido. O calor dá energia para as partículas se soltarem; o resfriamento deixa as forças de atração vencerem e criarem ordem.",
        "Todo material faz isso do seu jeito - mas o princípio é o mesmo: equilíbrio entre movimento térmico e atração intermolecular.",
        "Incrível de ver, né? Você acabou de assistir a matéria ir do caos total para a ordem perfeita - só abaixando a temperatura. Parabéns!"
      ]
    }
  }
}